## Final Project Submission

Please fill out:
* Student name: __Scott Okamura__
* Student pace: ___self paced___ / part time / full time
* Scheduled project review date/time: 
* Instructor name: __Jeff Herman__
* Blog post URL:

In [1]:
ls

CONTRIBUTING.md
LICENSE.md
README.md
The-Ramen-Rater-The-Big-List-1-3400-Current-As-Of-Jan-25-2020.xlsx
module_3_project_rubric.pdf
ramen-ratings.csv
smart.gif
student.ipynb

In [2]:
import pandas as pd

In [3]:
df = pd.read_excel('The-Ramen-Rater-The-Big-List-1-3400-Current-As-Of-Jan-25-2020.xlsx')

df.head()

,Review #,Brand,Variety,Style,Country,Stars
0,3400,EDO Pack,Kumamoto Flavour Noodles,Cup,Hong Kong,1
1,3399,Pan Mee,Goreng Dried Chili Shrimp Flavour,Pack,Malaysia,5
2,3398,Paldo,King Lid Ramen Noodle Soup,Pack,South Korea,5
3,3397,Nissin Miojo,Cremoso Carno Com Chili,Pack,Brazil,2
4,3396,Samyang Foods,Cham Ramen Big Bowl,Bowl,South Korea,2.25

In [4]:
df.describe()

          Review #
count  3400.000000
mean   1700.500000
std     981.639785
min       1.000000
25%     850.750000
50%    1700.500000
75%    2550.250000
max    3400.000000

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3400 entries, 0 to 3399
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Review #  3400 non-null   int64
 1   Brand     3400 non-null   object
 2   Variety   3400 non-null   object
 3   Style     3400 non-null   object
 4   Country   3400 non-null   object
 5   Stars     3400 non-null   object
dtypes: int64(1), object(5)
memory usage: 159.5+ KB

In [11]:
df.shape

(3400, 6)

In [12]:
df.isna().sum()

Review #    0
Brand       0
Variety     0
Style       0
Country     0
Stars       0
dtype: int64

In [13]:
df.isnull().sum()

Review #    0
Brand       0
Variety     0
Style       0
Country     0
Stars       0
dtype: int64

In [14]:
df.dtypes

Review #     int64
Brand       object
Variety     object
Style       object
Country     object
Stars       object
dtype: object

In [15]:
df['Country'].value_counts()

Japan             606
United States     419
South Korea       383
Taiwan            351
China             217
Thailand          208
Malaysia          190
Hong Kong         159
Indonesia         152
Singapore         136
Vietnam           112
UK                 69
Canada             56
Philippines        51
India              41
Mexico             32
Germany            28
Australia          25
Brazil             20
Netherlands        16
Myanmar            14
Nepal              14
Bangladesh         12
Hungary             9
Pakistan            9
Colombia            6
Poland              6
Russia              5
Cambodia            5
Sarawak             5
Italy               4
Holland             4
France              4
Fiji                4
Finland             3
Sweden              3
Peru                3
Ukraine             3
Dubai               3
Ghana               2
Estonia             2
Spain               2
Nigeria             2
USA                 1
Phlippines          1
New Zealand         1
Portugal            1
United Kingdom      1
Name: Country, dtype: int64

In [16]:
df['Stars'].value_counts()

5                      593
3.75                   499
3.5                    486
4                      395
3.25                   214
4.5                    207
4.25                   200
3                      167
2.75                   109
2                       89
2.5                     89
4.75                    88
1.5                     48
1                       37
0                       37
2.25                    28
1.75                    28
0.5                     19
0.25                    16
1.25                    13
NR                       3
Unrated                  3
3.1                      2
1.1                      2
2.8                      2
4.125                    2
2.9                      2
4.25/5                   2
3.65                     1
0.75                     1
3.6                      1
0.1                      1
1.8                      1
3.2                      1
2.3                      1
2.85                     1
5/2.5                    1
3.5/2.5                  1
2017-05-04 00:00:00      1
3.7                      1
2017-05-05 00:00:00      1
0.9                      1
2.125                    1
2017-04-04 00:00:00      1
3.125                    1
4.5/5                    1
2.1                      1
3.4                      1
Name: Stars, dtype: int64